{
	"block-handbooktext-composter": "Compost is obtained through the <a href=\"handbook://ava_improvedcomposting:craftinginfo-composting\">composting</a> process.",

    "block-composter": "Compost bin",
    
    "blockhelp-composter-harvest": "Remove compost",
    "blockhelp-composter-add": "Add items",
    "blockhelp-composter-openlid": "Open lid",
    "blockhelp-composter-closelid": "Close lid",
    "blockhelp-composter-turn": "Turn compost (requires shovel)",
    
    "info-composter-ready": "Compost is ready",
    "info-composter-layers": "{0}/{1} layers",
    "info-composter-needsbrowns": "Needs browns",
    "info-composter-needsgreens": "Needs greens",
    "info-composter-lidclosed": "Lid is closed",
    "info-composter-lidopen": "Lid is open",
    "info-composter-lastturnedrecently": "Last turned less than a day ago",
    "info-composter-lastturned": "Last turned {0} days ago",
    "info-composter-wetness": "Wetness: <font color=\"{0}\">{1}%</font>",
    "info-composter-decompositionrate": "Decomposition rate: <font color=\"{0}\">{1}%</font>",
    "info-composter-decompositionprogress": "{0}% decomposed ({1} days left at current rate)",
    "info-composter-needsturning": "<font color=\"#ff8484\">Needs to be turned</font>",
    "info-composter-toodry": "<font color=\"#ff8484\">Too dry; needs more water</font>",
    "info-composter-toowet": "<font color=\"#ff8484\">Too wet; close the lid if it's rainy</font>",

    "craftinginfo-composting-title": "Crafting Mechanic: Composting",
    "craftinginfo-composting-text": "<strong>Composting</strong><br>You need <a href=\"handbook://game:block-soil-ferthigh\">terra preta</a> to get the most out of your farms, and to make terra preta you'll need plenty of compost. The process takes time and effort, but with enough patience you'll find yourself with plenty of rich, earthy loam for mixing into soil or feeding to your lovely plants.<br><br><strong>Setup</strong><br>To start composting, you'll need to build at least one <a href=\"handbook://block-composter\">composting bin</a>. Once you've found a place for it, you'll need to set up a fertile mix, composed of carbon-rich <i>browns</i> and nitrogen-rich <i>greens.</i><br><br>A full list of things you can use for this purpose includes:<br><br><i>Browns:</i> Dry grass, twigs, firewood or planks for wood chips, paper, many plant types<br><i>Greens:</i> Raw fruits and vegetables (berries require four times as much), fruit mash, eggs<br><br>Each compost bin has room for ten layers. The bottom four must be filled with browns, and the top six must alternate between greens and browns. Fill up the bin until you can't fit anything else inside, and then it'll begin to decompose!<br><br><strong>Maintenance</strong><br>Composting requires care and attention; you can't just toss some rotten food in a barrel and come back a few months later. Healthy decomposition needs two things: air and water.<br><br>Keeping an aerated pile is simple: just <i>turn</i> the compost by right-clicking it with a shovel to make sure it gets proper air circulation. That's it! You'll need to do this at least once every three days -- if the bin goes too long without being turned, decomposition will start to slow down dramatically as the interior of the pile is starved of fresh air.<br><br>You'll also need to keep your compost moist, but not too wet; between 25% and 75% wetness is optimal. Rain will passively moisten the mix over time, but otherwise you can use a bowl, bucket, or other liquid container to add water yourself. If it gets too dry, just give it more water; if the compost gets too wet, there's nothing to do but give it time to dry out. If you're in a rainy area and you're afraid of your compost getting drenched, you can interact with the bin with an empty hand to close the lid, preventing any of the water from soaking in.<br><br><strong>Harvest</strong><br>Once your compost is complete, you're done! Simply interact with the bin to scoop out the earthy goodness, and it'll be left empty and ready for another batch. Assuming optimal care, the composting process takes a bit over twenty days; by contrast, a batch that's left uncared for could take as long as seventy or eighty, depending on local conditions.<br><br><strong>Problems</strong><br><i>The compost needs \"turning\":</i> Interact with the bin while holding a shovel. You'll need to do this once every three days at minimum.<br><br><i>The compost is too wet:</i> If you live in a rainy area, the weather might be soaking your compost. Each bin comes with a lid; simply right-click the bin with an empty hand to close the lid and prevent the rain from soaking in, and open it again whenever you need to add water. Compost dries slowly, so try to prevent it from getting too wet in the first place.<br><br><i>The compost is too dry:</i> You'll need to add more water. Use a bowl, bucket, or other liquid container to moisten the pile, or expose it to rainfall. Decomposition should return to full speed immediately.",
}